views/layouts/main.php

SELECT * FROM `cliente` WHERE `usuario_id`=4
---
            $menuItems[] = ['label' => 'Meu Painel', 'url' => ['/cliente/index']];

            // Buscar empresa do cliente
            $cliente = \app\models\Cliente::findOne(['usuario_id' => $user->id]);