views/layouts/public.php

$empresa = null;
$empresa_id = Yii::$app->request->get('empresa_id');
if ($empresa_id) {
    $empresa = \app\models\Empresa::findOne($empresa_id);
---
SELECT * FROM `empresa` WHERE `id`='7'