controllers/AdminController.php

SELECT COUNT(*) FROM `empresa`
SELECT COUNT(*) FROM `usuario`
SELECT COUNT(*) FROM `funcionario`
SELECT COUNT(*) FROM `servico`
---
    public function actionIndex()
    {
        $totalEmpresas = Empresa::find()->count();
        $totalUsuarios = Usuario::find()->count();
        $totalFuncionarios = Funcionario::find()->count();
        $totalServicos = Servico::find()->count();