controllers/ClienteController.php

SELECT * FROM `cliente` WHERE `usuario_id`=4
---
    public function actionIndex()
    {
        $user = Yii::$app->user->identity;

        // Buscar cliente associado ao usuário
        $cliente = Cliente::findOne(['usuario_id' => $user->id]);

SELECT * FROM `empresa` WHERE (`id`='1') AND (`status`=1)
SELECT * FROM `servico` WHERE (`empresa_id`='1') AND (`status`=1)
SELECT * FROM `funcionario` WHERE (`empresa_id`='1') AND (`status`=1)
SELECT * FROM `horario` WHERE (`empresa_id`='1') AND (`funcionario_id` IS NULL)
---
    public function actionAreaPublica($empresa_id)
    {
        $empresa = Empresa::findOne(['id' => $empresa_id, 'status' => 1]);

        if (!$empresa) {
            throw new \yii\web\NotFoundHttpException('Empresa não encontrada.');
        }

        $servicos = Servico::find()->where(['empresa_id' => $empresa_id, 'status' => 1])->all();
        $funcionarios = Funcionario::find()->where(['empresa_id' => $empresa_id, 'status' => 1])->all();
        $horarios = \app\models\Horario::find()->where(['empresa_id' => $empresa_id, 'funcionario_id' => null])->all();

SELECT * FROM `empresa` WHERE `status`=1
---
    public function actionEmpresas()
    {
        $empresas = Empresa::find()->where(['status' => 1])->all();