controllers/ClienteController.php

    public function actionAreaPublica($empresa_id)
    {
        // Garantir layout público
        $this->layout = 'public';

        $empresa = Empresa::findOne(['id' => $empresa_id, 'status' => 1]);

        if (!$empresa) {
            throw new \yii\web\NotFoundHttpException('Empresa não encontrada.');
        }

        $servicos = Servico::find()->where(['empresa_id' => $empresa_id, 'status' => 1])->all();
        $funcionarios = Funcionario::find()->where(['empresa_id' => $empresa_id, 'status' => 1])->all();
        $horarios = \app\models\Horario::find()->where(['empresa_id' => $empresa_id, 'funcionario_id' => null])->all();

        // Processar agendamento se for POST
        if (Yii::$app->request->isPost) {
            $cliente_data = Yii::$app->request->post('Cliente', []);
            $agendamento_data = Yii::$app->request->post('Agendamento', []);

            $cliente = null;

            // Se usuário não está logado, criar conta automática
            if (Yii::$app->user->isGuest && !empty($cliente_data)) {
                $usuario = new Usuario();
                $cliente_obj = new Cliente();

                // Verificar se email já existe
                $existingUser = Usuario::findOne(['email' => $cliente_data['email']]);
---
SELECT * FROM `empresa` WHERE (`id`='8') AND (`status`=1)
SELECT * FROM `servico` WHERE (`empresa_id`='8') AND (`status`=1)
SELECT * FROM `funcionario` WHERE (`empresa_id`='8') AND (`status`=1)
SELECT * FROM `horario` WHERE (`empresa_id`='8') AND (`funcionario_id` IS NULL)
SELECT * FROM `cliente` WHERE `usuario_id`=2

                if ($user->isAdminEmpresa()) {
                    Yii::$app->session->setFlash('info', 'Como administrador da empresa, você está visualizando a área pública. Para agendar, faça logout e acesse como cliente.');
                } else {
                    $cliente = Cliente::findOne(['usuario_id' => $user->id]);
---
SELECT * FROM `cliente` WHERE `usuario_id`=16

                $agendamento->funcionario_id = $agendamento_data['funcionario_id'] ?? null;
                $agendamento->status = Agendamento::STATUS_PENDENTE;

                if ($agendamento->save()) {
---
INSERT INTO `agendamento` (`data_agendamento`, `cliente_id`, `empresa_id`, `servico_id`, `funcionario_id`, `status`, `created_at`, `updated_at`) VALUES ('2025-12-24 09:00:00', 4, 8, 5, 4, 'pendente', '2025-12-22 18:13:07', '2025-12-22 18:13:07')

    public function actionCadastro($empresa_id)
    {
        $empresa = Empresa::findOne(['id' => $empresa_id, 'status' => 1]);
---
SELECT * FROM `empresa` WHERE (`id`='8') AND (`status`=1)