controllers/EmpresaController.php

    public function actionIndex()
    {
        $empresa_id = Yii::$app->user->identity->empresa_id;

        return $this->render('index', [
            'empresa_id' => $empresa_id,
            'totalServicos' => Servico::find()->where(['empresa_id' => $empresa_id])->count(),
            'totalFuncionarios' => Funcionario::find()->where(['empresa_id' => $empresa_id])->count(),
            'totalClientes' => Cliente::find()->where(['empresa_id' => $empresa_id])->count(),
            'totalAgendamentos' => Agendamento::find()->where(['empresa_id' => $empresa_id])->count(),
        ]);
---
SELECT COUNT(*) FROM `agendamento` WHERE `empresa_id`=8
SELECT COUNT(*) FROM `cliente` WHERE `empresa_id`=8
SELECT COUNT(*) FROM `funcionario` WHERE `empresa_id`=8
SELECT COUNT(*) FROM `servico` WHERE `empresa_id`=8
SELECT COUNT(*) FROM `servico` WHERE `empresa_id`=1
SELECT COUNT(*) FROM `funcionario` WHERE `empresa_id`=1
SELECT COUNT(*) FROM `cliente` WHERE `empresa_id`=1
SELECT COUNT(*) FROM `agendamento` WHERE `empresa_id`=1

    public function actionCriarServico()
    {
        $model = new Servico();
        $model->empresa_id = Yii::$app->user->identity->empresa_id;

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `servico` (`empresa_id`, `nome`, `descricao`, `preco`, `duracao_minutos`, `status`, `created_at`, `updated_at`) VALUES (7, 'barba', 'barba', '25', 40, 1, '2025-12-21 18:15:41', '2025-12-21 18:15:41')

    public function actionCriarFuncionario()
    {
        $model = new Funcionario();
        $model->empresa_id = Yii::$app->user->identity->empresa_id;

        if ($model->load(Yii::$app->request->post())) {
            $usuario = new \app\models\Usuario();
            $usuario->username = $model->nome . '_func_' . time();
            $usuario->email = $model->email;
            $usuario->setPassword(Yii::$app->request->post('senha'));
            $usuario->generateAuthKey();
            $usuario->role = \app\models\Usuario::ROLE_FUNCIONARIO;
            $usuario->empresa_id = $model->empresa_id;
            $usuario->nome_completo = $model->nome;
            $usuario->status = 1;

            if ($usuario->save()) {
---
INSERT INTO `usuario` (`username`, `email`, `password_hash`, `auth_key`, `role`, `empresa_id`, `nome_completo`, `status`, `created_at`, `updated_at`) VALUES ('juliano_func_1766341137', 'juliano@dedeco.com', '$2y$13$.JyE0cQRajXhWeBf/7I5X.t5SyT9kBzh5EAmRBs8o.RVSM6v1NBby', 'Mce9-QxKFcgw_wYO4gZw9WceHASKcOxi', 'funcionario', 7, 'juliano', 1, '2025-12-21 18:18:57', '2025-12-21 18:18:57')

    public function actionEditarFuncionario($id)
    {
        $model = Funcionario::findOne($id);
        $this->verificarEmpresa($model->empresa_id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
SELECT * FROM `funcionario` WHERE `id`='4'

    public function actionConfigurarHorarios($funcionario_id = null)
    {
        // Se não especificou funcionário_id, mostra lista de funcionários
        if ($funcionario_id === null) {
            $empresa_id = Yii::$app->user->identity->empresa_id;
            $funcionarios = Funcionario::find()->where(['empresa_id' => $empresa_id])->all();

            return $this->render('listar-funcionarios-horarios', [
                'funcionarios' => $funcionarios,
            ]);
        }

        $funcionario = Funcionario::findOne($funcionario_id);
        if (!$funcionario) {
            throw new \yii\web\NotFoundHttpException('Funcionário não encontrado.');
        }
        $this->verificarEmpresa($funcionario->empresa_id);

        $horarios = Horario::find()->where(['funcionario_id' => $funcionario_id])->all();

        if (Yii::$app->request->isPost) {
            $horarios_post = Yii::$app->request->post('horarios', []);

            // Deletar horários existentes
            Horario::deleteAll(['funcionario_id' => $funcionario_id]);
---
SELECT * FROM `funcionario` WHERE `empresa_id`=7
SELECT * FROM `funcionario` WHERE `id`='2'
SELECT * FROM `horario` WHERE `funcionario_id`='2'
DELETE FROM `horario` WHERE `funcionario_id`='2'

                    $horario->hora_inicio = $dados['hora_inicio'];
                    $horario->hora_fim = $dados['hora_fim'];
                    $horario->disponivel = isset($dados['disponivel']) ? 1 : 0;
                    $horario->save();
---
INSERT INTO `horario` (`funcionario_id`, `empresa_id`, `dia_semana`, `hora_inicio`, `hora_fim`, `disponivel`, `created_at`, `updated_at`) VALUES (2, 7, 0, '07:00', '18:00', 0, '2025-12-21 18:29:05', '2025-12-21 18:29:05')

    public function actionConfirmarAgendamento($id)
    {
        $model = Agendamento::findOne($id);
        $this->verificarEmpresa($model->empresa_id);

        if (Yii::$app->request->isPost) {
            $model->status = Agendamento::STATUS_CONFIRMADO;
            $model->save();
---
SELECT * FROM `agendamento` WHERE `id`='1'
UPDATE `agendamento` SET `status`='confirmado', `updated_at`='2025-12-21 18:36:44' WHERE `id`=1

    public function actionConfiguracoes()
    {
        $empresa_id = Yii::$app->user->identity->empresa_id;
        $empresa = \app\models\Empresa::findOne($empresa_id);

        if (!$empresa) {
            throw new \yii\web\NotFoundHttpException('Empresa não encontrada.');
        }

        if ($empresa->load(Yii::$app->request->post()) && $empresa->save()) {
---
SELECT * FROM `empresa` WHERE `id`=8

    public function actionHorarioEmpresa()
    {
        $empresa_id = Yii::$app->user->identity->empresa_id;
        $empresa = \app\models\Empresa::findOne($empresa_id);

        if (!$empresa) {
            throw new \yii\web\NotFoundHttpException('Empresa não encontrada.');
        }

        // Buscar horários da empresa
        $horarios = Horario::find()->where(['empresa_id' => $empresa_id])->andWhere(['IS', 'funcionario_id', null])->all();

        if (Yii::$app->request->isPost) {
            $horarios_post = Yii::$app->request->post('horarios', []);

            // Deletar horários existentes da empresa
            Horario::deleteAll(['empresa_id' => $empresa_id, 'funcionario_id' => null]);
---
SELECT * FROM `empresa` WHERE `id`=7
SELECT * FROM `horario` WHERE (`empresa_id`=7) AND (`funcionario_id` IS NULL)
DELETE FROM `horario` WHERE (`empresa_id`=7) AND (`funcionario_id` IS NULL)

                    $horario->hora_fim = $dados['hora_fim'] . ':00';
                    $horario->disponivel = isset($dados['disponivel']) ? 1 : 0;

                    if (!$horario->save()) {
---
INSERT INTO `horario` (`funcionario_id`, `empresa_id`, `dia_semana`, `dia_semana_texto`, `hora_inicio`, `hora_fim`, `disponivel`, `created_at`, `updated_at`) VALUES (NULL, 7, 0, 'Domingo', '08:00:00', '18:00:00', 0, '2025-12-21 18:23:12', '2025-12-21 18:23:12')