views/cliente/login-cliente.php

// Se tem empresa_id, buscar a empresa
$empresa = null;
if (isset($empresa_id) && $empresa_id) {
    $empresa = \app\models\Empresa::findOne($empresa_id);
---
SELECT * FROM `empresa` WHERE `id`='8'