models/Usuario.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => 1]);
---
SELECT * FROM `usuario` WHERE (`id`=16) AND (`status`=1)

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => 1]);
---
SELECT * FROM `usuario` WHERE (`username`='devteste@teste.com') AND (`status`=1)